street-canyon/isothermal/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 8.3; //8.75

boundaryField
{
   
    inlet
    {
        type            fixedValue;
        value           uniform 8.3;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    topWall
    {
        type            zeroGradient;
    }
    
    floorWall
    {
        type            epsilonWallFunction;
        value           uniform 8.3;
        //lowReCorrection  true;
    }

    frontAndBack
    {
	type            empty;
    }
    
    building
    {
        type            epsilonWallFunction;
        value           uniform 8.3;
        //lowReCorrection  true;
    }
}


// ************************************************************************* //
